In [2]:
import sqlite3

In [3]:
def notCommon():
    with open("../HW4/animal.txt","r") as inFile:
        table = inFile.readlines()
        for attr in table:
            attr = attr.strip()
            schema = attr.split(',')
            if ('tiger' in schema[1] and 'common' not in schema[2]):
                print(schema[1])

In [4]:
notCommon()

 Siberian tiger
 South China tiger

In [6]:
def notRelated():
    with open("../HW4/animal.txt","r") as inFile:
        table = inFile.readlines()
        for attr in table:
            attr = attr.strip()
            schema = attr.split(',')
            if ('tiger' not in schema[1]):
                print(schema[1])

In [7]:
notRelated()

 Galapagos Penguin
 Emperor Penguin
 Sri Lankan sloth bear
 Grizzly bear
 Giant Panda bear
 Florida black bear
 Alpaca
 Llama

In [8]:
empTable="""
CREATE Table Employer (
    FName VARCHAR(25) not null,
    LName Varchar(25) not null,
    address Varchar(50),
    Primary Key(FName, LName)
);
"""
jobTable = """
CREATE Table Job (
    Job_name VARCHAR(25) not null,
    Salary Numeric(25) not null,
    assistant Varchar(50),
    Primary Key(Job_name)
);
"""
infoTable = """
CREATE Table Information (
    I_fname VARCHAR(25) not null,
    I_lname Varchar(25) not null,
    I_jobname Varchar(50),
    Primary Key(I_fname, I_lname,I_jobname),
    Foreign Key(I_fname, I_lname)
    References Employer(FName,LName),
    Foreign Key(I_jobname)
    References Job(Job_name)
);
"""

In [9]:
conn = sqlite3.connect('dsc450.db')
c1 = conn.cursor()
c2 = conn.cursor()
c3 = conn.cursor()

In [10]:
c1.execute("DROP TABLE Employer")
c2.execute("DROP TABLE Job")
c3.execute("DROP TABLE Information")

OperationalError: no such table: Employer

In [11]:
c1.execute(empTable)
c2.execute(jobTable)
c3.execute(infoTable)

In [12]:
ins1 = "INSERT OR IGNORE INTO Employer VALUES('%s','%s', '%s');"
ins2 = "INSERT OR IGNORE INTO Job VALUES(?, ?, ?);"
ins3 = "INSERT OR IGNORE INTO Information VALUES(?, ?, ?);"

In [14]:
with open("../HW4/data_module4_part2.txt", 'r') as inFile:
    db = inFile.readlines()
    for row in db:
        attr = row.strip().split(', ')
        c1.execute(ins1 % (attr[0], attr[1], attr[2]))
        c2.execute(ins2, (attr[3], attr[4], attr[5]))
        c3.execute(ins3, (attr[0], attr[1], attr[3]))
output1 = c1.execute('SELECT * FROM Employer')
output2 = c2.execute('SELECT * FROM Job')
output3 = c3.execute('SELECT * FROM Information')

In [15]:
inFile.close()
conn.commit()

In [16]:
e1 = output1.fetchall()
j2 = output2.fetchall()
i3 = output3.fetchall()

In [17]:
print('SELECT * FROM Employer; \n' +str(e1))
print('SELECT * FROM Employer; \n' +str(j2))
print('SELECT * FROM Employer; \n' +str(i3))

SELECT * FROM Employer;
[('John', 'Smith', '111 N. Wabash Avenue'), ('Jane', 'Doe', '243 S. Wabash Avenue'), ('Mike', 'Jackson', '1 Michigan Avenue'), ('Mary', 'Who', '20 S. Michigan Avenue')]
SELECT * FROM Employer;
[('plumber', 40000, 'NULL'), ('bouncer', 35000, 'NULL'), ('waitress', 50000, 'Yes'), ('accountant', 42000, 'Yes'), ('risk analyst', 80000, 'Yes')]
SELECT * FROM Employer;
[('John', 'Smith', 'plumber'), ('John', 'Smith', 'bouncer'), ('Jane', 'Doe', 'waitress'), ('Jane', 'Doe', 'accountant'), ('Jane', 'Doe', 'bouncer'), ('Mike', 'Jackson', 'accountant'), ('Mike', 'Jackson', 'plumber'), ('Mary', 'Who', 'accountant'), ('Mary', 'Who', 'risk analyst')]

In [18]:
conn.close()